                        *** Auth Admin ***
* create guard for admin in config/auth .
* create admins table .
* create Model Admin .
* عندك ميدلوير جاهزه في لارفل اسمها اوث بتشيك مسجل ولا مش مسجل .
* انت عملت جارد اسمه ادمن في الميدل وير الجاهزه دي بيستخدم مودل الادمن اللي بيشاور ع تيبل الادمنز .
* اذن كده بقا عندك جارد ممكن تستخدمه فى راوت يشيكلك اليوزر ده عامل لوجن في الجارد اللى بيشاور ع مودل اللى بيشاور ع تيبل ولا لا .
* بالشكل ده ,'middleware'=>'auth:admin' (اوث دي ثابته زي مقولنا ديفولت ف لارفل معناها مسجل ولا مش مسجل .
* ميدل وير اوثنتيكشن اللي جاهزه في لارفل دي بتشيك لو مش مسجل يروح فين والديفولت رجعه ع روت الوجن اذن لازم تعمل اسم الراوت بنفس الاسم اللي كتبته ف ميدل وير .
* التغيير اللى هتعمله فيها هو لو جيلك ع طريق اي ركويست اسمه ادمن ومش مسجل رجعه ع روات ادمن لوجن (لو انت ادمن سجل) .
* راوت الادمن لوجن لازم يكون بره ميدل وير عشان اي حد يقدر يدخل عليه .
* create login page .
* make request for validation admin login.
* مودل الادمن مش مودل عادي لا ده مودل هتشيك بيه من داتا بيز موجود ولا لا فزيه زي مودل الادمن extends Authenticatable .
* لحد دلوقتي كل حاجه شغاله ولو انت مسجل في تيبل الادمن ع طريق التينكر هيحولك ولو مش مسجل هيوديك ع راوت اللي قولتله عليه ف مييدل وير اوثنتيكتد .
* ميدل وير الاوثنتيكيشن ف لارفل معناه لو مسجل ف تيبل هيدخلك مش مسجل مش هتدخل .
* ميدل وير ريدايركت اف اوثنتيكيشن معناه لو انت مسجل تسجيل دخول ورحت ع رابط تسجيل الدخول تاني مش هيدخل .
* ميدل وير الاوث بتتعامل  ب ريكويست لانك لسه داخل لكن ميدل وير الريدايركت بتتعامل ب جارد لانط داخل اوردي .
* في ميدل وير الريدايركت اف اوثنتيكيشن بتقوله لو مسجل بجارد الادمن ورجعت ع راوت لوجن وديني ع راوت سيرفيس بروفيدرس ادمن
                        وده فيه كونست بتحوله ع يو ار ل الادمن اللى هو الراوت المسئول عن عرض الصفحه .
* بتضيف ميدل وير جيست ف راوت اللوجن ودي ثابته ف لارفل ومتشترحتش .

*
* add admin by this method .
    * php artisan tinker .
    * $admin = new App\Models\Admin();
    * $admin->name = "moaz marouf";
    * $admin->email = "moazmarouf444@gmail.com";
    * $admin->password = bcrypt(123456789);
    * $admin->save();
